---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ImportFailures.ImportTooManyElmentsToExplode
source: html/9e04d13e-c412-0f7d-bfea-154e52cf6b73.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ImportFailures.ImportTooManyElmentsToExplode Property

Import Instance has [Number] elements. Imports with more than 10,000 elements cannot be exploded.

## Syntax (C#)
```csharp
public static FailureDefinitionId ImportTooManyElmentsToExplode { get; }
```